{
    "products": [
      {"id":1,"title":"Fjallraven - Foldsack No. 1 Backpack, Fits 15 Laptops",
      "price":109.95,
      "description":"Your perfect pack for everyday use and walks in the forest. Stash your laptop (up to 15 inches) in the padded sleeve, your everyday",
      "category":"men's clothing",
      "imagen":"https://fakestoreapi.com/img/81fPKd-2AYL._AC_SL1500_.jpg",
      "rating":{"rate":3.9,"count":120}},
      
      {"id":2,
      "title":"Mens Casual Premium Slim Fit T-Shirts ",
      "price":22.3,
      "description":"Slim-fitting style, contrast raglan long sleeve, three-button henley placket, light weight & soft fabric for breathable and comfortable wearing. And Solid stitched shirts with round neck made for durability and a great fit for casual fashion wear and diehard baseball fans. The Henley style round neckline includes a three-button placket.",
      "category":"men's clothing",
      "imagen":"https://fakestoreapi.com/img/71-3HjGNDUL._AC_SY879._SX._UX._SY._UY_.jpg",
      "rating":{"rate":4.1,"count":259}},

        {"id":6,
        "title":"Solid Gold Petite Micropave ",
        "price":"168",
        "description":"Pendientes tipo túnel con doble acampanado chapados en oro rosa. Fabricado en acero inoxidable 316L.",
        "category":"joyas",
        "imagen":"https://fakestoreapi.com/img/51UDEzMJVpL._AC_UL640_QL65_ML3_.jpg",
        "rating":
          {"rate":1.9,
          "count ":100}},

        {"id":9,
        "title":"Disco duro externo portátil WD Elements de 2 TB - USB 3.0 ",
        "price":64,
        "description":"Compatibilidad con USB 3.0 y USB 2.0 Transferencias de datos rápidas Mejore el rendimiento de la PC Alta capacidad; Compatibilidad NTFS formateado para Windows 10, Windows 8.1, Windows 7; Es posible que sea necesario reformatear para otros sistemas operativos; La compatibilidad puede variar según la configuración de hardware y el sistema operativo del usuario",
        "category":"electronics",
        "imagen":"https://fakestoreapi.com/img/61U7T1koQqL._AC_SX679_.jpg",
        "rating": 
          {"rate":2.9,
          "count":470}},

        {"id":11,
        "title":"Silicon Power 256GB SSD 3D NAND A55 SLC Cache Performance Boost SATA III 2.5",
        "price":109,
        "description":"3D NAND flash se aplica para ofrecer altas velocidades de transferencia Velocidades de transferencia notables que permiten un arranque más rápido y un mejor rendimiento general del sistema. La avanzada tecnología SLC Cache permite aumentar el rendimiento y prolongar la vida útil. Diseño delgado de 7 mm adecuado para ultrabooks y portátiles ultradelgados. Admite el comando TRIM, la tecnología Garbage Collection, RAID y ECC (Comprobación y corrección de errores) para proporcionar un rendimiento optimizado y una confiabilidad mejorada.",
        "category":"electronics",
        "imagen":"https://fakestoreapi.com/img/81QpkIctqPL._AC_SX679_.jpg",
        "rating":
          {"rate":2.9 ,
          "count":250}},
        
        {"id":14,
        "title":"Monitor curvo para juegos Samsung CHG90 de 49 pulgadas y 144 Hz (LC49HG90DMNXZA) - Super Ultrawide Screen QLED ",
        "price":999.99,
        "description": "49 PULGADAS SUPER ULTRAWIDE 32: 9 MONITOR DE JUEGO CURVADO con pantalla dual de 27 pulgadas una al lado de la otra TECNOLOGÍA QUANTUM DOT (QLED), compatibilidad con HDR y calibración de fábrica que proporciona un color y un contraste sorprendentemente realistas y precisos ALTA VELOCIDAD DE REFRESCO DE 144 HZ y un tiempo de respuesta ultrarrápido de 1 ms para eliminar el desenfoque de movimiento, las imágenes fantasma, y reducir el retraso de entrada",
        "category":"electronics",
        "imagen":"https://fakestoreapi.com/img/81Zt42ioCgL._AC_SX679_.jpg",
        "rating":
          {"rate":2.2,
          "count" :140}},
        
          {"id":17,
          "title":"Rain Jacket Women Windbreaker Striped Climbing Raincoats",
          "price":39.99,
          "description":"Lightweight perfet for trip or casual wear---Long sleeve with hooded, adjustable drawstring waist design. Button and zipper front closure raincoat, fully stripes Lined and The Raincoat has 2 side pockets are a good size to hold all kinds of things, it covers the hips, and the hood is generous but doesn't overdo it.Attached Cotton Lined Hood with Adjustable Drawstrings give it a real styled look.",
          "category":"women's clothing",
          "imagen":"https://fakestoreapi.com/img/71HblAHs5xL._AC_UY879_-2.jpg",
          "rating":
            {"rate":3.8,
            "count":679}},
          
        {"id":18,
        "title":"MBJ Women's Solid Short Sleeve Boat Neck V ",
        "price":9.85,
        "description":"95% RAYON 5% SPANDEX, Made in USA or Imported, Do Not Bleach, Lightweight fabric with great stretch for comfort, Ribbed on sleeves and neckline / Double stitching on bottom hem",
        "category":"women's clothing",
        "imagen":"https://fakestoreapi.com/img/71z3kpMAYsL._AC_UY879_.jpg",
        "rating":
           {"rate":4.7,
           "count":130}},
        
      {"id":19,
      "title":"Opna Women's Short Sleeve Moisture",
      "price":7.95,
      "description":"100% Polyester, Machine wash, 100% cationic polyester interlock, Machine Wash & Pre Shrunk for a Great Fit, Lightweight, roomy and highly breathable with moisture wicking fabric which helps to keep moisture away, Soft Lightweight Fabric with comfortable V-neck collar and a slimmer fit, delivers a sleek, more feminine silhouette and Added Comfort",
      "category":"women's clothing",
      "imagen":"https://fakestoreapi.com/img/51eg55uWmdL._AC_UX679_.jpg",
      "rating":{"rate":4.5,"count":146}},
      
      {"id":20,
      "title":"DANVOUY Womens T Shirt Casual Cotton Short",
      "price":12.99,
      "description":"95%Cotton,5%Spandex, Features: Casual, Short Sleeve, Letter Print,V-Neck,Fashion Tees, The fabric is soft and has some stretch., Occasion: Casual/Office/Beach/School/Home/Street. Season: Spring,Summer,Autumn,Winter.",
      "category":"women's clothing",
      "imagen":"https://fakestoreapi.com/img/61pHAEJ4NML._AC_UX679_.jpg",
      "rating":
        {"rate":3.6,
        "count":145}}
    ]
  }